// ====================================================================================

import React, { useState } from 'react';
import axios from 'axios';

// ====================================================================================

const UploadFile = () => {
  // Состояние для хранения выбранного файла
  const [file, setFile] = useState(null);
  // Состояние для хранения расписания, полученного с сервера
  const [schedule, setSchedule] = useState(null);

// ====================================================================================

  // Обработчик изменения файла
  const handleFileChange = (event) => {
    setFile(event.target.files[0]); // Обновляем состояние файла
  };

// ====================================================================================

  // Обработчик отправки файла на сервер
  const handleSubmit = async () => {
    const formData = new FormData();
    formData.append('file', file); // Добавляем файл в FormData

    try {
      // Отправляем файл на сервер
      const response = await axios.post('http://localhost:8000/upload/', formData, {
        headers: {
          'Content-Type': 'multipart/form-data' // Устанавливаем заголовок для формы данных
        }
      });
      // Обновляем состояние расписания с данными, полученными с сервера
      setSchedule(response.data);
    } catch (error) {
      // В случае ошибки выводим ее в консоль
      console.error('Error:', error);
    }
  };

// ====================================================================================

  return (
    <div>
      {/* Поле для выбора файла */}
      <input type="file" onChange={handleFileChange} />

      {/* Кнопка для отправки файла на сервер */}
      <button onClick={handleSubmit}>Upload</button>
      
      {/* Если есть расписание, отображаем его */}
      {schedule && (
        <div>
          {/* Отображение расписания для первой недели */}
          <h2>Первая неделя</h2>
          <pre>{JSON.stringify(schedule['Первая неделя'], null, 2)}</pre>
          {/* Отображение расписания для второй недели */}
          <h2>Вторая неделя</h2>
          <pre>{JSON.stringify(schedule['Вторая неделя'], null, 2)}</pre>
        </div>
      )}
    </div>
  );
};

// ====================================================================================

export default UploadFile;

// ====================================================================================
